In [2]:
import pandas as pd
import numpy as np

### 1. Wczytaj zbiór danych Titanic

In [3]:
Titanic = pd.read_csv('Titanic.csv')
Titanic.head(20)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29,0,0,24160,211.3375,B5,S,2,?,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.55,C22 C26,S,11,?,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2,1,2,113781,151.55,C22 C26,S,?,?,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30,1,2,113781,151.55,C22 C26,S,?,135,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25,1,2,113781,151.55,C22 C26,S,?,?,"Montreal, PQ / Chesterville, ON"
5,1,1,"Anderson, Mr. Harry",male,48,0,0,19952,26.55,E12,S,3,?,"New York, NY"
6,1,1,"Andrews, Miss. Kornelia Theodosia",female,63,1,0,13502,77.9583,D7,S,10,?,"Hudson, NY"
7,1,0,"Andrews, Mr. Thomas Jr",male,39,0,0,112050,0,A36,S,?,?,"Belfast, NI"
8,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53,2,0,11769,51.4792,C101,S,D,?,"Bayside, Queens, NY"
9,1,0,"Artagaveytia, Mr. Ramon",male,71,0,0,PC 17609,49.5042,?,C,?,22,"Montevideo, Uruguay"
10,1,0,"Astor, Col. John Jacob",male,47,1,0,PC 17757,227.525,C62 C64,C,?,124,"New York, NY"
11,1,1,"Astor, Mrs. John Jacob (Madeleine Talmadge Force)",female,18,1,0,PC 17757,227.525,C62 C64,C,4,?,"New York, NY"
12,1,1,"Aubart, Mme. Leontine Pauline",female,24,0,0,PC 17477,69.3,B35,C,9,?,"Paris, France"
13,1,1,"Barber, Miss. Ellen 'Nellie'",female,26,0,0,19877,78.85,?,S,6,?,?
14,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80,0,0,27042,30,A23,S,B,?,"Hessle, Yorks"
15,1,0,"Baumann, Mr. John D",male,?,0,0,PC 17318,25.925,?,S,?,?,"New York, NY"
16,1,0,"Baxter, Mr. Quigg Edmond",male,24,0,1,PC 17558,247.5208,B58 B60,C,?,?,"Montreal, PQ"
17,1,1,"Baxter, Mrs. James (Helene DeLaudeniere Chaput)",female,50,0,1,PC 17558,247.5208,B58 B60,C,6,?,"Montreal, PQ"
18,1,1,"Bazzani, Miss. Albina",female,32,0,0,11813,76.2917,D15,C,8,?,?
19,1,0,"Beattie, Mr. Thomson",male,36,0,0,13050,75.2417,C6,C,A,?,"Winnipeg, MN"

### 2. Dokonaj wstępnej inspekcji pierwszych 20 wierszy. Co widzisz?
Analiza wstępna 20 pierwszych wierszy pokazała, że w zbiorze znajdują się dane brakujące, które oznaczone są "?". Wstępnie najwięcej z nich widać w kolumnach "boat" oraz "body".

### 3. Sprawdź ile jest wartości brakujących używając funkcji pd.isnull().sum() oraz pd.isnull().mean.

Uwaga! Jest ich więcej niż 0. Czy zbiór danych należy zmodyfikować
przed użyciem w/w funkcji? Jeśli tak to jak? → wystarczy jedna linia
kodu:

Tak, zbiór przed użyciem funkcji należy zmodyfikować w taki sposób, aby brakujące dane oznaczone "?" były wartościami NaN w zbiorze, zamiany dokonuję poprzez funkcję replace().

In [4]:
Titanic=Titanic.replace('?',np.NaN)
missing_v = Titanic.isnull().sum()
print(missing_v)

pclass          0
survived        0
name            0
sex             0
age           263
sibsp           0
parch           0
ticket          0
fare            1
cabin        1014
embarked        2
boat          823
body         1188
home.dest     564
dtype: int64

In [5]:
missing_v_mean = Titanic.isnull().mean()
print(missing_v_mean)

pclass       0.000000
survived     0.000000
name         0.000000
sex          0.000000
age          0.200917
sibsp        0.000000
parch        0.000000
ticket       0.000000
fare         0.000764
cabin        0.774637
embarked     0.001528
boat         0.628724
body         0.907563
home.dest    0.430863
dtype: float64

### W sprawozdaniu zapisz swoje obserwację i skomentuj % brakujących danych w zależności od danej zmiennej.

Po wyświetleniu % brakujących danych w zależności od zmiennej można zauważyć, że najwięcej braków ma zmienna body, bo aż 91%, następnie zmienna cabin 77%, zmienna boat 63%, zmienna home.dest 43%, zmienna age 20%, braki mniejsze od 1% można zaobserwować w zmiennych fare oraz embarked.

### 4. Zastanów się z jakim rodzajem braków danych masz do czynienia
całkowicie przypadkowe (MCAR), przypadkowe (MAR) czy nie przypadkowe (MNAR). Swój wybór uzasadnij. Pamiętaj, że są to dane tragicznego rejsu, w którym spora część pasażerów nie przeżyła.

In [6]:
Titanic['ageNull'] = np.where(Titanic['age'].isnull(),1,0)
Titanic.groupby(['survived'])['ageNull'].mean()

survived
0    0.234858
1    0.146000
Name: ageNull, dtype: float64

In [7]:
Titanic['age'].isna().groupby(Titanic['survived']).mean()

survived
0    0.234858
1    0.146000
Name: age, dtype: float64

In [8]:
Titanic[['age','fare','cabin','embarked','boat','body','home.dest']].isnull().groupby(Titanic['survived']).mean()

,age,fare,cabin,embarked,boat,body,home.dest
survived,,,,,,,
0,0.234858,0.001236,0.873918,0.000,0.988875,0.850433,0.508035
1,0.146000,0.000000,0.614000,0.004,0.046000,1.000000,0.306000

Analizując dane brakujące w poszczególnych kolumnach, można stwierdzić, że braki są znaczące dla analizy, nie są one przypadkowe, są to braki typu MNAR.
Np. to, że dla 85% danych związanych z osobami, które nie przeżyły, numer identyfikacji ciała jest nieznany. Dodatkowo brakujące wartości występują w danych z informacją o łodziach ratunkowych i dane pokazują, że dla osób, które nie przeżyły mamy aż 98% brakującyh wartośći, natomiast tylko 5% braków dla osób które przeżyły. Nasuwa się tu wniosek, że większość braków informacji występuje tam, gdzie osoba nie przeżyła katastrofy. Prawdopodobnie są to osoby, które nie zostały zidentyfikowane lub nie było o tych osobach wszystkich informacji. Katastrofa wydarzyła się kilkaset lat temu, trzeba też wziąć pod uwagę fakt, że dane mogły nie zostać zebrane od razu po katastrofie lub mogły też np. zaginąć, ulec zniszczeniu.

### 5. Po powyższej analizie odpowiedz na pytanie w jaki sposób należy postąpić z brakującymi wartościami.

- nawiązując do kolumn "fare" oraz "embarked" braki danych można uznać za całkowicie przypadkowe i je usunąć, ponieważ procent takich danych jest mniejszy od 1%;
- dane w kolumnach cabin, boat, body oraz home.dest można umieścić w nowej kategorii missing, z której można by było wyciągnąć istotne wnioski;
- brak danych związany z kolumną age nie jest zbyt wysoki, lecz istony i można brakujące dane uzupełnić np. wartością średnią

In [9]:
Titanic.head(20)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,ageNull
0,1,1,"Allen, Miss. Elisabeth Walton",female,29,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO",0
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.55,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON",0
2,1,0,"Allison, Miss. Helen Loraine",female,2,1,2,113781,151.55,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",0
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30,1,2,113781,151.55,C22 C26,S,NaN,135,"Montreal, PQ / Chesterville, ON",0
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25,1,2,113781,151.55,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",0
5,1,1,"Anderson, Mr. Harry",male,48,0,0,19952,26.55,E12,S,3,NaN,"New York, NY",0
6,1,1,"Andrews, Miss. Kornelia Theodosia",female,63,1,0,13502,77.9583,D7,S,10,NaN,"Hudson, NY",0
7,1,0,"Andrews, Mr. Thomas Jr",male,39,0,0,112050,0,A36,S,NaN,NaN,"Belfast, NI",0
8,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53,2,0,11769,51.4792,C101,S,D,NaN,"Bayside, Queens, NY",0
9,1,0,"Artagaveytia, Mr. Ramon",male,71,0,0,PC 17609,49.5042,NaN,C,NaN,22,"Montevideo, Uruguay",0
10,1,0,"Astor, Col. John Jacob",male,47,1,0,PC 17757,227.525,C62 C64,C,NaN,124,"New York, NY",0
11,1,1,"Astor, Mrs. John Jacob (Madeleine Talmadge Force)",female,18,1,0,PC 17757,227.525,C62 C64,C,4,NaN,"New York, NY",0
12,1,1,"Aubart, Mme. Leontine Pauline",female,24,0,0,PC 17477,69.3,B35,C,9,NaN,"Paris, France",0
13,1,1,"Barber, Miss. Ellen 'Nellie'",female,26,0,0,19877,78.85,NaN,S,6,NaN,NaN,0
14,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80,0,0,27042,30,A23,S,B,NaN,"Hessle, Yorks",0
15,1,0,"Baumann, Mr. John D",male,NaN,0,0,PC 17318,25.925,NaN,S,NaN,NaN,"New York, NY",1
16,1,0,"Baxter, Mr. Quigg Edmond",male,24,0,1,PC 17558,247.5208,B58 B60,C,NaN,NaN,"Montreal, PQ",0
17,1,1,"Baxter, Mrs. James (Helene DeLaudeniere Chaput)",female,50,0,1,PC 17558,247.5208,B58 B60,C,6,NaN,"Montreal, PQ",0
18,1,1,"Bazzani, Miss. Albina",female,32,0,0,11813,76.2917,D15,C,8,NaN,NaN,0
19,1,0,"Beattie, Mr. Thomson",male,36,0,0,13050,75.2417,C6,C,A,NaN,"Winnipeg, MN",0

In [11]:
Titanic.to_csv('Titanic2.csv')